ViewSpecific Property
 Identifies if the element is owned by a view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public bool ViewSpecific { get; }
  Visual Basic
Public ReadOnly Property ViewSpecific As Boolean
	Get
  Visual C++
public:
property bool ViewSpecific {
	bool get ();
}
 See Also
  Element Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →